export default function SectionCBAM() {
    return (
        <section className="w-full md:h-screen sm:h-[100px] bg-[#011F1F] flex items-center justify-center text-white px-6">
            <div className="max-w-[960px] text-left space-y-6">
                <h2
                    className="text-[42px] leading-[100%]"
                    style={{ fontFamily: '"Chonburi", cursive' }}
                >
                    CBAM เขย่าอุตสาหกรรมไทย เมื่อคาร์บอนกลายเป็นต้นทุนใหม่ของเศรษฐกิจโลก ไทยรับมือหรือแค่ซื้อสิทธิปล่อยก๊าซ?
                </h2>

                <p
                    className="text-[22px] leading-[45px] indent-8"
                    style={{ fontFamily: '"IBM Plex Sans Thai Looped", sans-serif' }}
                >
                    การบังคับใช้มาตรการ CBAM (Carbon Border Adjustment Mechanism) ของสหภาพยุโรปตั้งแต่ปี 2566 กลายเป็นแรงกระเพื่อมใหญ่ต่ออุตสาหกรรมส่งออกของไทย โดยเฉพาะกลุ่มเหล็ก ซีเมนต์ ปุ๋ย อะลูมิเนียม ไฮโดรเจน และอาหาร ที่ต้องเผชิญกับภาษีนำเข้าสูงขึ้น หากไม่สามารถรายงานการปล่อยก๊าซเรือนกระจกได้ตามมาตรฐานที่ยุโรปกำหนด             มาตรการ CBAM มีเป้าหมายชัดเจนในการป้องกัน “การรั่วไหลของคาร์บอน” จากการนำเข้าสินค้าจากประเทศที่ไม่มีนโยบายสิ่งแวดล้อมเข้มงวดเท่าภายใน EU โดยการคำนวณภาษีจะอิงจากข้อมูลการปล่อยคาร์บอนตลอดวงจรชีวิตของผลิตภัณฑ์ (Life Cycle Assessment: LCA)                                                                                                                                       จุดอ่อนของไทย คือการขาดระบบบังคับในการตรวจวัดและรายงานคาร์บอนอย่างเป็นระบบและโปร่งใส ส่งผลให้ผู้ประกอบการส่วนใหญ่ยังไม่สามารถระบุค่าคาร์บอนฟุตพรินต์ของสินค้าได้อย่างชัดเจน กลายเป็นภาระต้นทุน และลดความสามารถในการแข่งขันในตลาดยุโรปและโลก                                                                                                            เพื่อหลีกเลี่ยงผลกระทบโดยตรง หลายธุรกิจจึงหันมาใช้กลไก “ตลาดคาร์บอนสมัครใจ” เช่น การซื้อขายคาร์บอนเครดิตจากโครงการปลูกป่าหรือโครงการดูดซับก๊าซเรือนกระจกอื่น ๆ เพื่อชดเชยการปล่อยคาร์บอนของตนเอง
                </p>
                <p
                    className="text-[22px] leading-[45px] indent-8"
                    style={{ fontFamily: '"IBM Plex Sans Thai Looped", sans-serif' }}
                >
                    
                </p>
            </div>
        </section>
    );
}
